charliermarsh.ruff
ecmel.vscode-html-css
gruntfuggly.todo-tree
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
njpwerner.autodocstring
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
stylelint.vscode-stylelint
syler.sass-indented
twxs.cmake
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
